# coding: utf8

item_gfx_dict = (
	('青リンゴ (青苹果)', 2, (1, 2)),
	('赤リンゴ (红苹果)', 2, (6, 4)),
	('金のリンゴ (金苹果)', 2, (9, 7)),
	('いやしの果実 (美味果实)', 3, (14, 11, 12)),
	('太陽の実 (橘子)', 1, (18,)),
	('千里眼の実 (千里眼果实)', 4, (20, 21, 22, 19)),
	('しのびの実 (青柠檬)', 2, (26, 25)),
	('速さの実 (柠檬)', 1, (27,)),
	('バナナ (香蕉)', 1, (31,)),
	('危険なバナナ (危险的香蕉)', 3, (33, 34, 35)),
	('赤いキノコ (红蘑菇)', 2, (37, 39)),
	('青いキノコ (蓝蘑菇)', 2, (41, 43)),
	('炎の実 (耐热椒)', 3, (45, 46, 47)),
	('氷の実 (耐冰椒)', 3, (48, 49, 50)),
	('がまんの実 (青椒)', 2, (52, 51)),
	('やせがまんの実 (黄椒)', 2, (55, 56)),
	('カラびょうたん (空葫芦)', 2, (60, 61)),
	('太陽樹の葉 (太阳树之叶)', 4, (65, 66, 64, 67)),
	('呪いのカボチャ (诅咒南瓜)', 3, (69, 70, 71)),
	('復活の果実 (复活果实)', 3, (76, 75, 74)),
	('倍増ニンジン (倍增萝卜)', 3, (77, 78, 79)),
	('倍速ニンジン (倍速萝卜)', 3, (82, 83, 84)),
	('命の果実 (生命果实)', 4, (90, 87, 88, 89)),
	('くさった実 (腐烂果实)', 3, (94, 92, 91)),
	('テルテルボーズ (晴天娃娃)', 4, (95, 96, 97, 97)),
	('ズーボルテルテ (阴天娃娃)', 4, (95, 96, 97, 97)),
	('おてんきゲタ (天气木屐)', 3, (105, 106, 107)),
	('星のカード (星星之卡)', 4, (113, 113, 118, 114)),
	('愚者のカード (愚者之卡)', 3, (117, 118, 114)),
	('暗黒カード (暗黑之卡)', 3, (119, 118, 114)),
	('銀貨 (银币)', 1, (123,)),
	('丸のカギ (圆形钥匙)', 3, (126, 125, 124)),
	('三角のカギ (三角钥匙)', 3, (129, 130, 124)),
	('四角のカギ (四角钥匙)', 3, (134, 132, 124)),
	('バツのカギ (叉型钥匙)', 3, (135, 125, 124)),
	('ソルの紋章 (太阳纹章)', 2, (140, 139)),
	('ルナの紋章 (月亮纹章)', 2, (140, 139)),
	('フレイムの紋章 (火焰纹章)', 2, (140, 139)),
	('フロストの紋章 (冰冻纹章)', 3, (140, 139, 139)),
	('クラウドの紋章 (紫云纹章)', 2, (140, 139)),
	('アースの紋章 (大地纹章)', 2, (140, 139)),
	('ダークの紋章 (暗黑纹章)', 2, (140, 139)),
)

pt = 0xD27026
pt_offset = 0x0618
start = 0xD286A5

#attrib D286A5-D28993
item_modify = open('../../hack/rom/bokutai.gba', 'r').read()[start:]

for item in item_gfx_dict:
	attr_offset = item[1]*8
	print u';%s' % item[0].decode('utf8')
	print '.org 0x08%06X' % pt
	print '.byte 0x%02X' % item[1]
	pt += 14

	print '.org 0x08%06X' % pt
	pt_str = '%04X' % pt_offset
	print '.byte 0x%s,0x%s' % (pt_str[2:], pt_str[:2])
	pt_offset += attr_offset
	pt += 6
	
	print '.org 0x08%06X' % start
	start += attr_offset

	for i in item[2]:
		i = i-1
		piece = item_modify[i*8:i*8+8]
		text = '.byte '
		for char in piece:
			text += '0x%02X,' % ord(char)
		print text[:-1]
	print ''
